Blog.org
#+Title: Blog
#+Author: Mario Román
#+Email: mromang08@gmail.com
#+Date: 26 December 2019
#+Creator: <a href="https://mroman42.github.com">@mroman42</a>.
#+Options: toc:nil date:t num:nil html-style:nil html-postamble:t
#+export_file_name: docs/blog.html

* TODO The GranaSAT client                                                                    :post:
:PROPERTIES:
:TITLE: The GranaSAT client
:EXPORT_FILE_NAME: granasatclient.html
:INDEX_DATE: <2019-07-03 Wed>
:END:

Some time ago I wrote a GTK+ app in C for the [[https://github.com/mroman42/granasatClient][GranaSAT project]]. I did
not know anything about GUI design but I was eager to learn.  The only
requirement was that it had to be written in C (or Java) and using
Eclipse (that should set your alarm bells ringing); but the rest of
the specifications were changing every day, making this a very
challenging /software engineering/ project. The code is licensed under
GPLv3 and you can browse it in [[https://github.com/mroman42/granasatClient][its repository]], the correspoding server
was written by [[https://github.com/agarciamontoro/granasatServer][@agarciamontoro]].

/Bonus track:/ the team ended up capturing an [[https://www.youtube.com/watch?v=YUlWg6wuCxo][aurora borealis]]!

