granasatclient.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-07-03 Wed 13:01 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>The GranaSAT client</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Mario Román" />
<link rel="stylesheet" href="default.css" />
<link rel="stylesheet" href="mathjax_fonts.css" />
<link rel="stylesheet" href="syntax.css" />
<div id="header">
<div id="logo">
<a hrwef="blog.html">Mario Román</a>
</div>
<div id="navigation">
<a href="about.html">About</a>
<a href="blog.html">Blog</a>
<a href="math.html">Math</a>
<a href="feed.xml">RSS</a>
</div>
</div>
</head>
<body>
<div id="content">
<h1 class="title">The GranaSAT client</h1>
<p>
Some time ago I wrote a GTK+ app in C for the <a href="https://github.com/mroman42/granasatClient">GranaSAT project</a>. I did
not know anything about GUI design but I was eager to learn.  The only
requirement was that it had to be written in C (or Java) and using
Eclipse (that should set your alarm bells ringing); but the rest of
the specifications were changing every day, making this a very
challenging <i>software engineering</i> project. The code is licensed under
GPLv3 and you can browse it in <a href="https://github.com/mroman42/granasatClient">its repository</a>, the correspoding server
was written by <a href="https://github.com/agarciamontoro/granasatServer">@agarciamontoro</a>.
</p>

<p>
<i>Bonus track:</i> the team ended up capturing an <a href="https://www.youtube.com/watch?v=YUlWg6wuCxo">aurora borealis</a>!
</p>
</div>
<div id="postamble" class="status">
<div id="footer"><p class="postamble">Last edited . Written by <a href="https://mroman42.github.com">@mroman42</a>.</p></div>
</div>
</body>
</html>
